:PROPERTIES:
:ID:       704cb428-157c-4498-a339-acc991cbc8cc
:END:
#+title: Algorithms and Data Structures Beginner Course
#+url: https://www.youtube.com/watch?v=8hly31xKli0

**** Implementation
#+begin_src python :results output
list = [10,20,30,40]
target = 30
def linear_search(list, target):
    """
    Returns target position else returns None
    """
    for i in range(0,len(list)):
        if (list[i] == target):
            return i
    return None

def verify(index):
    if index is not None:
        print("Target is found at index: ", index)
    else:
        print("Target is not found.")

print(verify(linear_search(list,target)))
#+end_src

#+RESULTS:
: Target is found at index:  2
: None

**** Implementation

#+name binary_search
#+begin_src python :results output
list = [10,20,30,40,50,60,77,80,90]
target = 50
def binary_search(list, target):
    """
    Returns target position else returns None
    """
    i = 0
    l = len(list) -1
    while  i <= l :
        m = l+i//2
        if(list[m] == target):
            return m
        elif(list[m] > target):
            l = m - 1;
        else:
            i = m + 1;
    return None;

def verify(index):
    if index is not None:
        print("Target is found at index: ", index)
    else:
        print("Target is not found.")

print(verify(binary_search(list,target)))
#+end_src

#+RESULTS:
: Target is found at index:  4
: None

#+name: recursive_binary_search
#+begin_src python :results output
list = [10,20,30,40,50,60,77,80,90]
target = 40

def recursive_binary_search(list, target): # the recursive function is good if you dont want to know location and just want to verify its is in the list
    if( list == [] ): #is it a good idea to start with end case?
        return False
    mid = len(list)//2
    if list[mid] == target:
        return True
    elif list[mid] < target:
        return recursive_binary_search(list[mid + 1:],target)
    else:
        return recursive_binary_search(list[:mid],target)

def verify(res):
    if res:
        print("Target is found.")
    else:
        print("Target is not found.")

print(verify(recursive_binary_search(list,target)))

#+end_src

#+RESULTS: recursive_binary_search
: Target is found.
: None


*** Arrays
- Arrays are contiguous data structure
- depending on programming language Arrays can be heterogenous or homogenous
  - languags like swift and JavaScript arrays are homogenous
- elements are accessed using an index
#+BEGIN_SRC python :results output
new_list = [1,2,3]
result = new_list[0]
print(result)

if 1 in new_list: print(True)
for n in new_list:
    if n==1:
        print(True)
    break

#+END_SRC

#+RESULTS:
: 1
: True
: True
**** Implementation
#+NAME: Node-Class
#+BEGIN_SRC python
class Node:
    """
    An object for storing single node of linked list.
    """

    data = None
    next = None

    def __init__(self, data):
        self.data = data

    def __repr__(self):  # str representation of obj
        return "<Node data: %s>" % self.data

#+END_SRC

#+RESULTS: Node-Class
: None

#+RESULTS: Initialize_Node

#+RESULTS:
: <Node data: 1>

#+NAME: LinkedList-Class
#+BEGIN_SRC python  :noweb yes
<<Node-Class>>

class LinkedList:
    """
    Singly Linked List
    """

    def __init__(self):
        self.head = None

    def is_empty(self):
        return self.head == None

    def size(self):
        current = self.head
        count = 0
        while current:
            count += 1
            current = current.next
        return count

    def append(self, data):
        current = self.head
        if(current == None):
            self.head = Node(data)
        else:
            while(current.next):
                current = current.next
            current.next = Node(data)

    def insert(self, index, data):
        new_node = Node(data)
        current_pos = 0
        current_node = self.head

        if index > self.size():
            raise IndexError("Index out of bounds");
        if index == 0:
            new_node.next = self.head
            self.head = new_node
        else:
            prev_node = None
             #you want to get the node before the position you want to add to not lose prev reference
            while current_pos < index -1:
                current_node = current_node.next
                current_pos +=1

            new_node.next = current_node.next
            current_node.next = new_node

    def search(self, target):
        current = self.head

        while current:
            if current.data == target:
                return current
            else:
                current = current.next

        return None

    def remove(self, target):
        current = self.head
        prev = None
        while current and current.data != target:
            prev = current
            current = current.next

        if prev:
            prev.next = current.next
        else:
            self.head = current.next

    def __repr__(self):
        current = self.head
        nodes = []

        while current:
            if current is self.head:
                nodes.append("(HEAD: %s)" % current.data)
            elif current.next is None:
                nodes.append("(TAIL: %s)" % current.data)
            else:
                nodes.append("(%s)" % current.data)
            current = current.next
        return  '->'.join(nodes)

#+END_SRC

#+RESULTS: LinkedList-Class
: None

#+RESULTS:

#+BEGIN_SRC python :results output :noweb yes
<<LinkedList-Class>>
linked_list = LinkedList()
linked_list.append(1)
linked_list.append(2)
linked_list.append(3)
linked_list.append(4)
linked_list.append(5)
linked_list.append(6)
linked_list.insert(2, 2.5)
linked_list.remove(6)
print("Found: ", linked_list.search(2.5))
print(linked_list)
#+END_SRC

#+RESULTS:
: Found:  <Node data: 2.5>
: (HEAD: 1)->(2)->(2.5)->(3)->(4)->(TAIL: 5)
